WangWen-Believer/Biped-Robot-project/机器人图像传输/OV2640NEW/单片机代码/STM32F103R_1024_768OK/OnChip_Drivers/NVIC_EXIT/Rename_Pin.h
#ifndef RENAME_PIN_H_H_
#define RENAME_PIN_H_H_
#include "stm32f10x.h"

//PA
#define PA0			GPIO_Pin_0
#define PA1			GPIO_Pin_1
#define PA2			GPIO_Pin_2
#define PA3			GPIO_Pin_3
#define PA4			GPIO_Pin_4
#define PA5			GPIO_Pin_5
#define PA6			GPIO_Pin_6
#define PA7			GPIO_Pin_7
#define PA8			GPIO_Pin_8
#define PA9			GPIO_Pin_9
#define PA10		GPIO_Pin_10
#define PA11		GPIO_Pin_11
#define PA12		GPIO_Pin_12
#define PA13		GPIO_Pin_13
#define PA14		GPIO_Pin_14
#define PA15		GPIO_Pin_15
//PB
#define PB0			GPIO_Pin_0
#define PB1			GPIO_Pin_1
#define PB2			GPIO_Pin_2
#define PB3			GPIO_Pin_3
#define PB4			GPIO_Pin_4
#define PB5			GPIO_Pin_5
#define PB6			GPIO_Pin_6
#define PB7			GPIO_Pin_7
#define PB8			GPIO_Pin_8
#define PB9			GPIO_Pin_9
#define PB10		GPIO_Pin_10
#define PB11		GPIO_Pin_11
#define PB12		GPIO_Pin_12
#define PB13		GPIO_Pin_13
#define PB14		GPIO_Pin_14
#define PB15		GPIO_Pin_15
//PC
#define PC0			GPIO_Pin_0
#define PC1			GPIO_Pin_1
#define PC2			GPIO_Pin_2
#define PC3			GPIO_Pin_3
#define PC4			GPIO_Pin_4
#define PC5			GPIO_Pin_5
#define PC6			GPIO_Pin_6
#define PC7			GPIO_Pin_7
#define PC8			GPIO_Pin_8
#define PC9			GPIO_Pin_9
#define PC10		GPIO_Pin_10
#define PC11		GPIO_Pin_11
#define PC12		GPIO_Pin_12
#define PC13		GPIO_Pin_13
#define PC14		GPIO_Pin_14
#define PC15		GPIO_Pin_15
//PD
#define PD0			GPIO_Pin_0
#define PD1			GPIO_Pin_1
#define PD2			GPIO_Pin_2
#define PD3			GPIO_Pin_3
#define PD4			GPIO_Pin_4
#define PD5			GPIO_Pin_5
#define PD6			GPIO_Pin_6
#define PD7			GPIO_Pin_7
#define PD8			GPIO_Pin_8
#define PD9			GPIO_Pin_9
#define PD10		GPIO_Pin_10
#define PD11		GPIO_Pin_11
#define PD12		GPIO_Pin_12
#define PD13		GPIO_Pin_13
#define PD14		GPIO_Pin_14
#define PD15		GPIO_Pin_15
//PE
#define PE0			GPIO_Pin_0
#define PE1			GPIO_Pin_1
#define PE2			GPIO_Pin_2
#define PE3			GPIO_Pin_3
#define PE4			GPIO_Pin_4
#define PE5			GPIO_Pin_5
#define PE6			GPIO_Pin_6
#define PE7			GPIO_Pin_7
#define PE8			GPIO_Pin_8
#define PE9			GPIO_Pin_9
#define PE10		GPIO_Pin_10
#define PE11		GPIO_Pin_11
#define PE12		GPIO_Pin_12
#define PE13		GPIO_Pin_13
#define PE14		GPIO_Pin_14
#define PE15		GPIO_Pin_15
//PF
#define PF0			GPIO_Pin_0
#define PF1			GPIO_Pin_1
#define PF2			GPIO_Pin_2
#define PF3			GPIO_Pin_3
#define PF4			GPIO_Pin_4
#define PF5			GPIO_Pin_5
#define PF6			GPIO_Pin_6
#define PF7			GPIO_Pin_7
#define PF8			GPIO_Pin_8
#define PF9			GPIO_Pin_9
#define PF10		GPIO_Pin_10
#define PF11		GPIO_Pin_11
#define PF12		GPIO_Pin_12
#define PF13		GPIO_Pin_13
#define PF14		GPIO_Pin_14
//PG
#define PG0			GPIO_Pin_0
#define PG1			GPIO_Pin_1
#define PG2			GPIO_Pin_2
#define PG3			GPIO_Pin_3
#define PG4			GPIO_Pin_4
#define PG5			GPIO_Pin_5
#define PG6			GPIO_Pin_6
#define PG7			GPIO_Pin_7
#define PG8			GPIO_Pin_8
#define PG9			GPIO_Pin_9
#define PG10		GPIO_Pin_10
#define PG11		GPIO_Pin_11
#define PG12		GPIO_Pin_12
#define PG13		GPIO_Pin_13
#define PG14		GPIO_Pin_14
#define PG15		GPIO_Pin_15
#define PF15		GPIO_Pin_15

#endif
